; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	thermograph1 - mode
	image0 - mode
	GroundStation1 - direction
	Star0 - direction
	Star2 - direction
	GroundStation4 - direction
	Star3 - direction
	Planet5 - direction
	Planet6 - direction
	Planet7 - direction
	Planet8 - direction
	Star9 - direction
	Planet10 - direction
	Star11 - direction
	Star12 - direction
	Planet13 - direction
	Phenomenon14 - direction
	Phenomenon15 - direction
)
(:init
	(supports instrument0 image0)
	(calibration_target instrument0 GroundStation1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet13)
	(supports instrument1 thermograph1)
	(supports instrument1 image0)
	(calibration_target instrument1 GroundStation4)
	(supports instrument2 image0)
	(calibration_target instrument2 GroundStation1)
	(supports instrument3 thermograph1)
	(supports instrument3 image0)
	(calibration_target instrument3 Star3)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon15)
	(supports instrument4 image0)
	(calibration_target instrument4 GroundStation1)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet13)
	(supports instrument5 thermograph1)
	(supports instrument5 image0)
	(calibration_target instrument5 Star3)
	(supports instrument6 image0)
	(calibration_target instrument6 Star3)
	(supports instrument7 thermograph1)
	(supports instrument7 image0)
	(calibration_target instrument7 Star0)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation4)
	(supports instrument8 thermograph1)
	(supports instrument8 image0)
	(calibration_target instrument8 Star2)
	(supports instrument9 thermograph1)
	(calibration_target instrument9 GroundStation4)
	(supports instrument10 thermograph1)
	(supports instrument10 image0)
	(calibration_target instrument10 Star3)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet7)
)
(:goal (and
	(pointing satellite1 Star11)
	(pointing satellite2 Planet13)
	(pointing satellite3 Star0)
	(pointing satellite4 Planet6)
	(have_image Planet5 image0)
	(have_image Planet6 image0)
	(have_image Planet7 image0)
	(have_image Planet8 image0)
	(have_image Star9 image0)
	(have_image Planet10 image0)
	(have_image Star11 thermograph1)
	(have_image Star12 image0)
	(have_image Planet13 image0)
	(have_image Phenomenon14 image0)
	(have_image Phenomenon15 thermograph1)
))

)

; plan
1. (turn_to satellite3 star0 groundstation4)
   deleted: (pointing satellite3 groundstation4)
   added: (pointing satellite3 star0)
   goals met: 2 of 15
2. (turn_to satellite1 groundstation4 phenomenon15)
   deleted: (pointing satellite1 phenomenon15)
   added: (pointing satellite1 groundstation4)
   goals met: 2 of 15
3. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 2 of 15
4. (calibrate satellite1 instrument1 groundstation4)
   added: (calibrated instrument1)
   goals met: 2 of 15
5. (turn_to satellite1 planet6 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 planet6)
   goals met: 2 of 15
6. (take_image satellite1 planet6 instrument1 image0)
   added: (have_image planet6 image0)
   goals met: 3 of 15
7. (turn_to satellite1 planet5 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 planet5)
   goals met: 3 of 15
8. (take_image satellite1 planet5 instrument1 image0)
   added: (have_image planet5 image0)
   goals met: 4 of 15
9. (turn_to satellite1 planet13 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 planet13)
   goals met: 4 of 15
10. (take_image satellite1 planet13 instrument1 image0)
   added: (have_image planet13 image0)
   goals met: 5 of 15
11. (turn_to satellite1 planet10 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 planet10)
   goals met: 5 of 15
12. (take_image satellite1 planet10 instrument1 image0)
   added: (have_image planet10 image0)
   goals met: 6 of 15
13. (turn_to satellite1 phenomenon15 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 phenomenon15)
   goals met: 6 of 15
14. (take_image satellite1 phenomenon15 instrument1 thermograph1)
   added: (have_image phenomenon15 thermograph1)
   goals met: 7 of 15
15. (turn_to satellite1 phenomenon14 phenomenon15)
   deleted: (pointing satellite1 phenomenon15)
   added: (pointing satellite1 phenomenon14)
   goals met: 7 of 15
16. (take_image satellite1 phenomenon14 instrument1 image0)
   added: (have_image phenomenon14 image0)
   goals met: 8 of 15
17. (turn_to satellite1 planet7 phenomenon14)
   deleted: (pointing satellite1 phenomenon14)
   added: (pointing satellite1 planet7)
   goals met: 8 of 15
18. (take_image satellite1 planet7 instrument1 image0)
   added: (have_image planet7 image0)
   goals met: 9 of 15
19. (turn_to satellite1 planet8 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 planet8)
   goals met: 9 of 15
20. (take_image satellite1 planet8 instrument1 image0)
   added: (have_image planet8 image0)
   goals met: 10 of 15
21. (turn_to satellite1 star12 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star12)
   goals met: 10 of 15
22. (take_image satellite1 star12 instrument1 image0)
   added: (have_image star12 image0)
   goals met: 11 of 15
23. (turn_to satellite1 star9 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 star9)
   goals met: 11 of 15
24. (take_image satellite1 star9 instrument1 image0)
   added: (have_image star9 image0)
   goals met: 12 of 15
25. (turn_to satellite1 star11 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 star11)
   goals met: 13 of 15
26. (take_image satellite1 star11 instrument1 thermograph1)
   added: (have_image star11 thermograph1)
   goals met: 14 of 15
27. (turn_to satellite4 planet6 planet7)
   deleted: (pointing satellite4 planet7)
   added: (pointing satellite4 planet6)
   goals met: 15 of 15
